blog/drafts/centered-non-centered.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Centered-non centered parametrization in Aesara</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Centered-non centered parametrization in Aesara</h1>

<div id="outline-container-orgb4af560" class="outline-2">
<h2 id="orgb4af560">Centered-non centered</h2>
<div class="outline-text-2" id="text-orgb4af560">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #6a737d;"># </span><span style="color: #6a737d;">Define a model in Aesara</span>
<span style="color: #d73a49;">import</span> aesara
<span style="color: #d73a49;">import</span> aesara.tensor <span style="color: #d73a49;">as</span> at

<span style="color: #24292e;">srng</span> = at.random.RandomStream(0)
<span style="color: #24292e;">mu_rv</span> = srng.normal(0, 1)
<span style="color: #24292e;">sigma_rv</span> = srng.halfnormal(1)
<span style="color: #24292e;">Y_rv</span> = srng.normal(mu_rv, sigma_rv)

<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Tell Aesara that `Y_rv` is the output variable</span>
<span style="color: #d73a49;">from</span> aesara.graph.fg <span style="color: #d73a49;">import</span> FunctionGraph

<span style="color: #24292e;">fgraph</span> = FunctionGraph(outputs=[Y_rv], clone=<span style="color: #005cc5;">False</span>)
aesara.dprint(fgraph)  <span style="color: #6a737d;"># </span><span style="color: #6a737d;">prints the Aesara graph</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Graph in the centered parametrization</span>
<span style="color: #6a737d;">#</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Y_rv ~ Normal(Normal(0, 1), HalfNormal(1))</span>
<span style="color: #6a737d;">#</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">normal_rv{0, (0, 0), floatX, False}.1 [id A] 2</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7FE81981C2E0&gt;) [id B]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|TensorConstant{[]} [id C]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|TensorConstant{11} [id D]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|normal_rv{0, (0, 0), floatX, False}.1 [id E] 1</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7FE819893680&gt;) [id F]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |TensorConstant{[]} [id G]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |TensorConstant{11} [id H]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |TensorConstant{0} [id I]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |TensorConstant{1} [id J]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|halfnormal_rv{0, (0, 0), floatX, False}.1 [id K] 0</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7FE819893CA0&gt;) [id L]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|TensorConstant{[]} [id M]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|TensorConstant{11} [id N]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|TensorConstant{1} [id O]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|TensorConstant{1.0} [id P]</span>

<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Transform the graph using the location-scale transform</span>
<span style="color: #d73a49;">from</span> aesara.graph.kanren <span style="color: #d73a49;">import</span> KanrenRelationSub
<span style="color: #d73a49;">from</span> aemcmc.transforms <span style="color: #d73a49;">import</span> location_scale_transform

<span style="color: #24292e;">transformed_fgraph</span> = KanrenRelationSub(location_scale_transform).transform(
    fgraph, fgraph.outputs[0].owner
)[0]
aesara.dprint(transformed_fgraph)
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Graph in the non-centered parametrization</span>
<span style="color: #6a737d;">#</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Y_rv ~ Normal(0, 1) +  HalfNormal(1) * Normal(0, 1)</span>
<span style="color: #6a737d;">#</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Elemwise{add,no_inplace} [id A]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|normal_rv{0, (0, 0), floatX, False}.1 [id B]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7FF308A03680&gt;) [id C]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |TensorConstant{[]} [id D]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |TensorConstant{11} [id E]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |TensorConstant{0} [id F]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |TensorConstant{1} [id G]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|Elemwise{mul,no_inplace} [id H]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|halfnormal_rv{0, (0, 0), floatX, False}.1 [id I]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">| |RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7FF308A03CA0&gt;) [id J]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">| |TensorConstant{[]} [id K]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">| |TensorConstant{11} [id L]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">| |TensorConstant{1} [id M]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">| |TensorConstant{1.0} [id N]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|normal_rv{0, (0, 0), floatX, False}.1 [id O]</span>
<span style="color: #6a737d;">#      </span><span style="color: #6a737d;">|RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7FF30878C2E0&gt;) [id P]</span>
<span style="color: #6a737d;">#      </span><span style="color: #6a737d;">|TensorConstant{[]} [id Q]</span>
<span style="color: #6a737d;">#      </span><span style="color: #6a737d;">|TensorConstant{11} [id R]</span>
<span style="color: #6a737d;">#      </span><span style="color: #6a737d;">|TensorConstant{0} [id S]</span>
<span style="color: #6a737d;">#      </span><span style="color: #6a737d;">|TensorConstant{1} [id T]</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org4969832" class="outline-2">
<h2 id="org4969832">Conjugates</h2>
<div class="outline-text-2" id="text-org4969832">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #d73a49;">import</span> aesara
<span style="color: #d73a49;">import</span> aesara.tensor <span style="color: #d73a49;">as</span> at

<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Define the model in Aesara</span>
<span style="color: #6a737d;">#</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">p_rv ~ Beta(a, b)</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Y_rv ~ Binomial(n, p_rv)</span>

<span style="color: #24292e;">alpha_tt</span> = at.scalar(<span style="color: #032f62;">"alpha"</span>)
<span style="color: #24292e;">beta_tt</span> = at.scalar(<span style="color: #032f62;">"beta"</span>)
<span style="color: #24292e;">n_tt</span> = at.scalar(<span style="color: #032f62;">"n"</span>)

<span style="color: #24292e;">srng</span> = at.random.RandomStream(0)
<span style="color: #24292e;">p_rv</span> = srng.beta(alpha_tt, beta_tt, name=<span style="color: #032f62;">"p"</span>)
<span style="color: #24292e;">Y_rv</span> = srng.binomial(n_tt, p_rv, name=<span style="color: #032f62;">"y"</span>)

aesara.dprint(Y_rv)
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">The Aesara model graph:</span>
<span style="color: #6a737d;">#</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">binomial_rv{0, (0, 0), int64, False}.1 [id A] 'y'</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7F1AB14E5620&gt;) [id B]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|TensorConstant{[]} [id C]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|TensorConstant{4} [id D]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|n [id E]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|beta_rv{0, (0, 0), floatX, False}.1 [id F] 'p'</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7F1AB14E50E0&gt;) [id G]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|TensorConstant{[]} [id H]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|TensorConstant{11} [id I]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|alpha [id J]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|beta [id K]</span>

<span style="color: #6a737d;"># </span><span style="color: #6a737d;">Transform the graph using beta-binomial conjugacy</span>
<span style="color: #d73a49;">from</span> kanren <span style="color: #d73a49;">import</span> run, var
<span style="color: #d73a49;">from</span> aesara.graph.rewriting.unify <span style="color: #d73a49;">import</span> eval_if_etuple
<span style="color: #d73a49;">from</span> aemcmc.conjugates <span style="color: #d73a49;">import</span> beta_binomial_conjugateo

<span style="color: #24292e;">y_vv</span> = Y_rv.clone()
<span style="color: #24292e;">y_vv.name</span> = <span style="color: #032f62;">"y"</span>

<span style="color: #24292e;">q_lv</span> = var()
(posterior_expr,) = run(1, q_lv, beta_binomial_conjugateo(y_vv, Y_rv, q_lv))
<span style="color: #24292e;">posterior</span> = eval_if_etuple(posterior_expr)

aesara.dprint(posterior)
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">The transformed graph represents p_rv's posterior distribution:</span>
<span style="color: #6a737d;">#</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">p_rv ~ Beta(a + y, b + n - y)</span>
<span style="color: #6a737d;">#</span>
<span style="color: #6a737d;"># </span><span style="color: #6a737d;">beta_rv{0, (0, 0), floatX, False}.1 [id A]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|RandomGeneratorSharedVariable(&lt;Generator(PCG64) at 0x7F1AB14E50E0&gt;) [id B]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|TensorConstant{[]} [id C]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|TensorConstant{11} [id D]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|Elemwise{add,no_inplace} [id E]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |alpha [id F]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">| |y [id G]</span>
<span style="color: #6a737d;">#  </span><span style="color: #6a737d;">|Elemwise{sub,no_inplace} [id H]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|Elemwise{add,no_inplace} [id I]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">| |beta [id J]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">| |n [id K]</span>
<span style="color: #6a737d;">#    </span><span style="color: #6a737d;">|y [id G]</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>